pandas (data manupuation / data prep)

pandas seres - one d array
pandas datframe - n*n matrix

In [1]:
pip install pandas

Collecting pandas
  Downloading pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl.metadata (91 kB)
Requirement already satisfied: numpy>=1.26.0 in /Users/akashbhandari/Library/Python/3.13/lib/python/site-packages (from pandas) (2.2.5)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/homebrew/Cellar/jupyterlab/4.4.7/libexec/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /opt/homebrew/Cellar/jupyterlab/4.4.7/libexec/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.3.3-cp313-cp313-macosx_11_0_arm64.whl (10.7 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 10.7/10.7 MB 11.0 MB/s  0:00:00eta 0:00:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 3/3 [pandas]2m2/3 [pandas]
Successfully installed pandas-2.3.3 pytz-2025.2 tzdata-2025.2
Note: you may need to restart the kernel to use updated packages.

In [35]:
import pandas as pd

In [36]:
print(pd.__version__)

2.3.3

In [37]:
l = [1,2,3,4,5,6]
pds = pd.Series(l , index = [10,20,30,40,50,60])
pds[10]

np.int64(1)

In [38]:
pds

10    1
20    2
30    3
40    4
50    5
60    6
dtype: int64

In [39]:
marks = {
    "phy" : [93,45,65,44],
    "chem" : [93,45,65,44],
    "maths" : [93,45,65,44],
    "bio" : [93,45,65,44]
}

In [40]:
marks

{'phy': [93, 45, 65, 44],
 'chem': [93, 45, 65, 44],
 'maths': [93, 45, 65, 44],
 'bio': [93, 45, 65, 44]}

In [41]:
df = pd.DataFrame(marks , index = ["payal" , "akash" , "pratham" , "pratibha"])

In [42]:
df

          phy  chem  maths  bio
payal      93    93     93   93
akash      45    45     45   45
pratham    65    65     65   65
pratibha   44    44     44   44

In [43]:
l = [[10,20,30],[40,50,60]]

In [44]:
ldf = pd.DataFrame(l , columns = ["a","b","c"] , dtype = 'f')

In [45]:
ldf

      a     b     c
0  10.0  20.0  30.0
1  40.0  50.0  60.0

In [46]:
ldf.shape

(2, 3)

In [47]:
df.shape

(4, 4)

In [48]:
df.head(2)

       phy  chem  maths  bio
payal   93    93     93   93
akash   45    45     45   45

In [49]:
df.tail(2)

          phy  chem  maths  bio
pratham    65    65     65   65
pratibha   44    44     44   44

In [50]:
na = df.values

In [51]:
na

array([[93, 93, 93, 93],
       [45, 45, 45, 45],
       [65, 65, 65, 65],
       [44, 44, 44, 44]])

In [52]:
df

          phy  chem  maths  bio
payal      93    93     93   93
akash      45    45     45   45
pratham    65    65     65   65
pratibha   44    44     44   44

In [53]:
df.columns

Index(['phy', 'chem', 'maths', 'bio'], dtype='object')

In [54]:
na[2][1]

np.int64(65)

In [55]:
df

          phy  chem  maths  bio
payal      93    93     93   93
akash      45    45     45   45
pratham    65    65     65   65
pratibha   44    44     44   44

In [56]:
df[["phy","chem"]]

          phy  chem
payal      93    93
akash      45    45
pratham    65    65
pratibha   44    44

In [57]:
df.loc[["payal", "akash"], ["phy","bio"]]

       phy  bio
payal   93   93
akash   45   45

In [58]:
df.loc[["akash"], ["phy" ]]

       phy
akash   45

In [59]:
df.iloc[1,1]

np.int64(45)

In [60]:
df.iloc[[0,2],[0,2]]

         phy  maths
payal     93     93
pratham   65     65

In [61]:
df.iloc[0:2:3 , 0:2:3]

       phy
payal   93

In [62]:
df.to_csv("marks.csv")

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, payal to pratibha
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   phy     4 non-null      int64
 1   chem    4 non-null      int64
 2   maths   4 non-null      int64
 3   bio     4 non-null      int64
dtypes: int64(4)
memory usage: 332.0+ bytes

In [70]:
df

          phy  chem  maths  bio
payal      93    93     93   93
akash      45    45     45   45
pratham    65    65     65   65
pratibha   44    44     44   44

In [71]:
df.iloc[[3,2,1],[0,1]]

          phy  chem
pratibha   44    44
pratham    65    65
akash      45    45

In [73]:
df[df['chem']<90]

          phy  chem  maths  bio
akash      45    45     45   45
pratham    65    65     65   65
pratibha   44    44     44   44

In [81]:
df[df['maths'] == 45]

          phy  chem  maths  bio
payal      93    93     45   93
akash      45    45     45   45
pratham    65    65     45   65
pratibha   44    44     45   44